Tekla.Structures.Model.BooleanPart
The BooleanPart class represents a part cut or an add. This means that a model object is, for example,
cut with a part instance to create a void to the father part. Typically the operative part is deleted after
the boolean cut operation. In case of boolean add, operative part is deleted automatically.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
Point point = new Point(0, 7000, 0);
Point point2 = new Point(1000, 7000, 0);
Beam Beam1 = new Beam();
Beam1.StartPoint = point;
Beam1.Profile.ProfileString = "400*400";
Beam1.EndPoint = point2;
Beam1.Insert();
Beam Beam2 = new Beam();
Beam2.Profile.ProfileString = "400*400";
Beam2.StartPoint = new Point(500, 6000, 0);
Beam2.EndPoint = new Point(500, 8000, 0);
Beam2.Class = BooleanPart.BooleanOperativeClassName;
Beam2.Insert();
BooleanPart Beam = new BooleanPart();
Beam.Father = Beam1;
Beam.SetOperativePart(Beam2);
// Beam.Type = BooleanPart.BooleanTypeEnum.BOOLEAN_ADD; // BOOLEAN_CUT is default type.
if(!Beam.Insert())
Console.WriteLine("Insert failed!");
Beam2.Delete(); // Not needed when using BOOLEAN_ADD, operative part is deleted automatically.
}
}

Tekla.Structures.Model.BooleanPart.BooleanOperativeClassName
A constant string that defines a part class name to be the boolean
operative part. This class must be used when inserting the operative part to
the database.

Tekla.Structures.Model.BooleanPart.Type
Defines the boolean operation: an add or a cut.

Tekla.Structures.Model.BooleanPart.OperativePart
The part that does the boolean operation. When Insert() is called, this field is overwritten
with a new part instance which is a copy of the original operative part. This part has the
same identifier as the boolean part. Modifications (such as profile change) have
to be made through the part instance and not the boolean part instance. The operative part's
class must be BooleanOperativeClass.

Tekla.Structures.Model.BooleanPart.#ctor
Instantiates an empty cut operation.

Tekla.Structures.Model.BooleanPart.SetOperativePart(Tekla.Structures.Model.Part)
Sets the part to operate with. The operative part's
class member must be defined to be BooleanOperativeClass.
Part: The operative part for the boolean.
Returns: True on success.

Tekla.Structures.Model.BooleanPart.Insert
Inserts the boolean part into the model database. All the attributes must be set.
The operative part is overwritten by a copy of the original part.
Returns: True on success.

Tekla.Structures.Model.BooleanPart.Select
Selects a boolean part from the model database. The part ID must be set.
Returns: True on success.

Tekla.Structures.Model.BooleanPart.Modify
Currently it is not possible to modify the boolean part as there is nothing
that can be modified for it. Calling this function will actually call modify for
the operative part member.
Returns: True on success.

Tekla.Structures.Model.BooleanPart.Delete
Deletes the boolean part instance with the given ID from the model database.
Returns: True on success.